In [7]:
import tweepy

bearer_token = "AAAAAAAAAAAAAAAAAAAAAAhrjgEAAAAAtaINtJuJDU%2F%2BCdOGL3BFon0rYzo%3DRBGMBkpmeImGMYSEnM0Sa8F2mCwZlidarulMjtMOuKqla8aWCs" # Twitter API
client = tweepy.Client(bearer_token=bearer_token) # Twitter API v2 with OAuth2.0 Version

#let's request and paginate the tweets
query = 'context:152.825047692124442624 -is:retweet lang:en'

limit = 1000 #n of tweets to be requested


tweets = tweepy.Paginator(client.search_recent_tweets,
                          query=query,
                          expansions=['author_id'],
                          tweet_fields=['public_metrics'],
                          max_results=100).flatten(limit=limit)

In [8]:
#Let's create the panda dataframe
import pandas as pd

df_tweets = pd.DataFrame([tweet.data['text'],
                          tweet.data['public_metrics']['retweet_count'],
                          tweet.data['public_metrics']['like_count'],
                          tweet.data['author_id']
                         ] for tweet in tweets) # convert to pandas df

In [9]:
display(df_tweets)

,0,1,2,3
0,Lunch date with one of my princesses after her...,0,0,40560852
1,Jim: So weâ€™re still on for lunch? Youâ€™re meeti...,0,0,1391308289720258560
2,lunch and dinner is when you proteinmax,0,0,1276340518939766786
3,yum yum lunch so good,0,0,956004288517599232
4,The best part about German dinners is that the...,0,0,277589619
...,...,...,...,...
995,"Thai Curried Winter Squash with Green Beans, C...",0,0,1605972011913580547
996,@YouTube @firstwefeast I think @firstwefeast ...,0,0,1543336965440929796
997,Lunch is served! Quaker Steaks is serving hot ...,0,2,30863863
998,Chanyeol sent a food truck support to Suho!! ðŸ¥°...,0,0,3113649555
999,That burrito I had for lunch was really yummy!...,0,0,294854263

In [10]:
#Let's rename the columns
df_tweets.rename(columns={0: "Text", 1: "Retweet", 2: "Likes", 3: "user_id"}, inplace=True)

In [11]:
#getting the number of followers(we need to do a for loop because we can ask for up to 100 followers at the time)
user_list = list(df_tweets["user_id"])
followers = pd.DataFrame()
#print(user_list[(1-1)*100:1*100-1])
for i in range(1,limit//100):
    users = tweepy.Paginator(client.get_users, 
                                 ids=user_list[(i-1)*100:i*100],
                                 user_fields=['public_metrics']).flatten(limit=100)
    f = pd.DataFrame([user.data['public_metrics']['followers_count'] for user in users])
    display(f)
    followers = pd.concat([followers,f])
display(followers)



    
    
    
    
    
#Let's add the column for the followers
#df_tweets['followers'] = followers

Unexpected parameter: pagination_token

       0
0   1872
1     85
2    128
3     51
4    807
..   ...
94    34
95  1547
96  1209
97  2202
98   576

[99 rows x 1 columns]

Unexpected parameter: pagination_token

        0
0      82
1       2
2     354
3      22
4     120
..    ...
94  60393
95     29
96   3579
97    541
98     95

[99 rows x 1 columns]

Unexpected parameter: pagination_token

       0
0    147
1    302
2    747
3    129
4   5646
..   ...
94   185
95    92
96  1054
97   287
98  2659

[99 rows x 1 columns]

Unexpected parameter: pagination_token

       0
0      0
1      2
2   2315
3    317
4    439
..   ...
94   353
95    80
96   236
97   296
98   583

[99 rows x 1 columns]

Unexpected parameter: pagination_token

       0
0   3713
1    495
2    147
3    129
4   2727
..   ...
94    43
95  1275
96   231
97   201
98   414

[99 rows x 1 columns]

Unexpected parameter: pagination_token

        0
0     144
1    1502
2     717
3    1529
4   14170
..    ...
94   1019
95    279
96    193
97   1158
98    224

[99 rows x 1 columns]

Unexpected parameter: pagination_token

        0
0    1756
1   25909
2     640
3      30
4     757
..    ...
94     27
95    247
96    156
97    270
98     47

[99 rows x 1 columns]

Unexpected parameter: pagination_token

       0
0     46
1    155
2   1308
3   4991
4   5327
..   ...
94  1131
95   595
96     1
97  7762
98  7367

[99 rows x 1 columns]

Unexpected parameter: pagination_token

        0
0     262
1     176
2   17319
3    4826
4      61
..    ...
94      7
95   4687
96    159
97  81059
98     17

[99 rows x 1 columns]

        0
0    1872
1      85
2     128
3      51
4     807
..    ...
94      7
95   4687
96    159
97  81059
98     17

[891 rows x 1 columns]

In [14]:
#getting the number of followers(we need to do a for loop because we can ask for up to 100 followers at the time)
user_list = list(df_tweets["user_id"])
followers = []
for i in range(1,limit//100):
    users = tweepy.Paginator(client.get_users, 
                                 ids=user_list[(i-1)*100:i*100],
                                 user_fields=['public_metrics']).flatten(limit=100)
    f = [user.data['public_metrics']['followers_count'] for user in users]
    followers.append(f)
    
print(followers)
    



    
    
    
    
    
#Let's add the column for the followers
#df_tweets['followers'] = followers

Unexpected parameter: pagination_token
Unexpected parameter: pagination_token
Unexpected parameter: pagination_token
Unexpected parameter: pagination_token
Unexpected parameter: pagination_token
Unexpected parameter: pagination_token
Unexpected parameter: pagination_token
Unexpected parameter: pagination_token
Unexpected parameter: pagination_token

[[1872, 85, 128, 51, 807, 762, 2235, 752, 5176, 139, 4040, 299, 96, 322, 12628, 856, 25, 741, 2012, 231, 1571, 112, 4140, 17, 361, 193, 0, 328, 427, 350, 36920, 14567, 1110472, 2992, 48, 2500, 16, 964, 1830, 250, 119, 492, 828, 815, 140, 52, 406, 763, 36, 813, 658, 2189, 448, 530, 234, 216, 5355, 1003, 108, 40, 539, 120, 620, 198, 1228, 2991, 2643, 317, 426, 5000, 2951, 0, 33, 103, 602382, 80, 11, 3106, 202, 2927, 1440, 145, 22, 124, 11611, 499, 197, 221, 267, 275, 72, 376, 482, 228, 34, 1547, 1209, 2202, 576, 1538], [82, 2, 354, 22, 120, 1098, 938, 176, 2282, 1014, 22, 31, 22, 1415, 383, 267, 2765, 12, 42, 1242, 350, 3426, 409, 981, 50, 1195, 131081, 250, 1890, 59, 650, 484, 5440, 5113, 628, 189, 34537, 180, 1515, 328, 6660, 429, 9062, 0, 37, 247, 705, 4164, 769, 283744, 837, 38, 13, 45, 10770, 746, 773, 274, 4041, 166, 4293, 144, 248, 37, 210, 121384, 49, 3, 140, 734, 245, 1286, 11611, 4374, 274, 66, 21, 194, 18, 3561, 297, 1339, 214, 199, 625, 281, 4868, 29268, 37, 50, 2098, 792, 212, 7830, 60393, 29, 3579, 541, 95, 3573], [147, 302, 747, 129, 5646, 4888, 147380, 27551, 8757, 11967, 10258, 3112, 2085462, 74, 4543, 909, 359, 15, 1980, 3966, 3440, 13900, 438, 889, 7484, 0, 5, 20096, 142, 2054, 1074, 10742, 483, 4321, 1722, 31, 111, 1019, 370, 66903, 7343, 14192, 387, 444, 8400, 22, 247, 238, 385, 5487, 133, 99, 57, 1416, 517, 47394, 8095, 1, 39, 201, 5820, 389, 34, 10893, 413, 790, 1057, 51, 532, 76, 208, 303, 1491, 592, 3250, 145, 98, 88, 101, 630, 91, 358, 3, 244, 223, 1407, 146, 465, 62, 111, 6, 2647, 2375, 1, 185, 92, 1054, 287, 2659, 17], [0, 2, 2315, 317, 439, 224, 13, 8, 444, 9, 145, 180, 75, 9, 1779, 92, 3035, 246, 927, 375, 1, 3858, 784, 672, 30, 437, 2478, 33, 6655, 303, 150, 4, 134, 1168, 146, 7877, 1229, 653, 8735, 141, 394, 666, 508, 375, 177, 34897, 28, 119, 451, 2375, 153, 160, 0, 644, 530, 185, 8, 13024, 555, 632, 6766, 149, 1856, 189, 2915, 179, 322, 1234, 14, 759, 425, 234, 662, 295, 595, 3, 173, 358, 12421, 2475, 751, 704, 738, 3832, 242, 260, 1121, 552, 1725, 212, 491, 52, 1318, 355, 353, 80, 236, 296, 583, 78], [3713, 495, 147, 129, 2727, 197, 1721, 4650, 750, 41, 169, 36434, 3401, 229, 64, 51, 1, 611, 2137, 2914, 25, 1935, 5066, 640, 280, 1355, 144, 3658, 74519, 214, 192, 222, 212, 373, 113634, 16, 511, 270, 6446, 30, 1726, 168, 82201, 296, 1490, 5304, 366, 143, 509, 5, 472, 7275, 1566, 531, 126, 631, 583, 4418, 78, 2673, 223, 236, 595, 30, 24495, 147, 2588, 179, 1438, 58, 352, 806, 65, 725, 29, 1858, 6252, 2269, 5927, 728, 2, 53, 15, 179, 5637, 1740, 678, 1287, 1434, 692, 5858, 7710, 1139, 644, 43, 1275, 231, 201, 414, 3007], [144, 1502, 717, 1529, 14170, 9, 32, 523, 1115, 1868, 34, 686, 1, 957, 197, 63, 709, 8, 8647, 26, 140, 2692, 177, 681, 27, 1772, 245, 881, 76, 214, 265, 301, 526, 311, 46071, 183, 624, 115, 90, 238, 637, 1404, 78408, 874, 1206, 291, 33944, 44, 6, 25, 9861, 450, 173, 160, 55, 7304, 2030, 243, 156, 146, 280, 342, 907, 18078, 35, 795, 1377, 2508, 1449, 170, 782, 5117, 523, 182, 594, 291, 2588, 179, 662, 127, 564, 542, 976, 8227, 12578, 103, 1009, 9, 602, 3443, 6193, 9065, 5154, 404, 1019, 279, 193, 1158, 224, 496], [1756, 25909, 640, 30, 757, 776, 5661, 52, 79, 580, 251, 202, 11, 60, 179, 73, 1608, 1267, 710, 1039, 49, 4, 591, 9, 265, 265, 4005, 189, 557, 392159, 17806, 3247, 557, 307, 339, 557, 6740, 463, 1087, 120, 9806, 24, 557, 22, 36, 312, 15, 14, 321, 194, 719, 167, 608, 4503, 661, 151, 329, 626, 503, 524, 841, 38, 5355, 608, 709, 30452, 116, 1045, 125, 280, 6, 54, 25644, 187, 85, 115, 206, 79, 2117, 10, 408, 363, 205, 3, 85, 1549, 236, 6460, 646, 106, 14, 738, 354, 1, 27, 247, 156, 270, 47, 167], [46, 155, 1308, 4991, 5327, 498, 8, 23, 597, 3528, 4, 2821, 778, 837, 350, 86, 1263, 33944, 1301, 232, 550, 159, 1195, 68, 516, 678, 64, 2053, 193, 181, 3209, 227, 335, 753, 2123, 104, 197, 716, 5681, 109, 781, 862, 37, 86, 534, 108, 481, 474, 709, 3, 3047, 387, 412, 696, 80, 87, 114, 57, 119, 564, 1366, 1290, 363, 412, 3503, 116, 12320, 3, 0, 18, 298, 61511, 28, 110, 599, 321, 1300, 119, 2533, 339, 1705, 3, 1375, 402, 58, 1122, 743, 49, 848, 3250, 1453, 1327, 396, 560, 1131, 595, 1, 7762, 7365, 26], [262, 176, 17319, 4826, 61, 477, 360, 1127, 1934, 1229, 1377, 333, 86, 240, 218, 28, 161, 643, 4055, 730, 2299, 195, 71, 748, 27, 109, 259, 481, 142, 298, 488, 338, 26347, 181, 28, 195, 2354, 298, 18896, 3, 150, 142, 127, 38, 835, 241, 653, 1, 6146, 1, 345, 61, 2472, 1065, 1427, 6, 6801, 47, 728, 120, 1184, 363, 62, 675, 95, 262, 10847, 117, 122, 7, 2, 2, 6, 455, 151, 701, 504, 759, 3723, 709, 20, 7, 8, 1225, 53, 455, 321, 1688, 385, 158, 1089, 24, 84, 1962, 7, 4687, 160, 81058, 17, 1161]]

In [ ]:
display(df_tweets)

In [ ]:
import os

path = os.getcwd()

In [ ]:
_ = df_tweets.to_csv(os.path.join(path,'Dataset1.csv'))#creates a csv file containing the tweets